app/controllers/library_controller.rb

SELECT "bookdetails".* FROM "bookdetails"
---
    def index
        @library = Bookdetail.all

SELECT "bookdetails".* FROM "bookdetails" WHERE "bookdetails"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        @library = Bookdetail.find(params[:id])

INSERT INTO "bookdetails" ("Book", "Author", "Description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Book", "pappu and friends"], ["Author", "franco mulakal"], ["Description", "thoreyal aashan"], ["created_at", "2020-02-13 17:24:38.126609"], ["updated_at", "2020-02-13 17:24:38.126609"]]
---
    def addbookdetail
        @library=Bookdetail.new(library_params)

        @library.save